boundarydevices/linux/drivers/net/wireless/rtlwifi/rtl8723as/core/rtw_bt_mp.c
					btOpcode = BT_LO_OP_GET_RX_PKT_CNT_H;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					pBtRsp->pParamStart[2] = pExtC2h->buf[0];
					pBtRsp->pParamStart[3] = pExtC2h->buf[1];
					paraLen = 4;
				}
				break;
			case BT_REPORT_RX_ERROR_BITS:
				{
					DBG_8192C("[MPT], [Rx Error Bits]\n");
					btOpcode = BT_LO_OP_GET_RX_ERROR_BITS_L;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					pBtRsp->pParamStart[0] = pExtC2h->buf[0];
					pBtRsp->pParamStart[1] = pExtC2h->buf[1];

					btOpcode = BT_LO_OP_GET_RX_ERROR_BITS_H;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					pBtRsp->pParamStart[2] = pExtC2h->buf[0];
					pBtRsp->pParamStart[3] = pExtC2h->buf[1];
					paraLen = 4;
				}
				break;
			case BT_REPORT_RSSI:
				{
					DBG_8192C("[MPT], [RSSI]\n");
					btOpcode = BT_LO_OP_GET_RSSI;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					pBtRsp->pParamStart[0] = pExtC2h->buf[0];
					pBtRsp->pParamStart[1] = pExtC2h->buf[1];
					paraLen = 2;
				}
				break;
			case BT_REPORT_CFO_HDR_QUALITY:
				{
					DBG_8192C("[MPT], [CFO & Header Quality]\n");
					btOpcode = BT_LO_OP_GET_CFO_HDR_QUALITY_L;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					pBtRsp->pParamStart[0] = pExtC2h->buf[0];
					pBtRsp->pParamStart[1] = pExtC2h->buf[1];

					btOpcode = BT_LO_OP_GET_CFO_HDR_QUALITY_H;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					pBtRsp->pParamStart[2] = pExtC2h->buf[0];
					pBtRsp->pParamStart[3] = pExtC2h->buf[1];
					paraLen = 4;
				}
				break;
			case BT_REPORT_CONNECT_TARGET_BD_ADDR:
				{
					DBG_8192C("[MPT], [Connected Target BD ADDR]\n");
					btOpcode = BT_LO_OP_GET_TARGET_BD_ADDR_L;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					bdAddr[5] = pExtC2h->buf[0];
					bdAddr[4] = pExtC2h->buf[1];
					bdAddr[3] = pExtC2h->buf[2];

					btOpcode = BT_LO_OP_GET_TARGET_BD_ADDR_H;
					h2cParaLen = 0;
					// execute h2c and check respond c2h from bt fw is correct or not
					retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
					// construct respond status code and data.
					if(BT_STATUS_BT_OP_SUCCESS != retStatus)
					{
						pBtRsp->status = ((btOpcode<<8)|retStatus);
						DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
						return paraLen;
					}
					bdAddr[2] = pExtC2h->buf[0];
					bdAddr[1] = pExtC2h->buf[1];
					bdAddr[0] = pExtC2h->buf[2];
						
					DBG_8192C("[MPT], Connected Target BDAddr:%s", bdAddr);
					for(i=0; i<6; i++)
					{
						pBtRsp->pParamStart[i] = bdAddr[5-i];
					}
					paraLen = 6;
				}
				break;
			default:
				pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
				return paraLen;
				break;
		}
	}

	pBtRsp->status = BT_STATUS_SUCCESS;
	return paraLen;
}



u2Byte
mptbt_BtSetGeneral(
	IN	PADAPTER		Adapter,
	IN	PBT_REQ_CMD 	pBtReq,
	IN	PBT_RSP_CMD 	pBtRsp
	)
{
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	u1Byte				setType=0;
	u2Byte				setParaLen=0, validParaLen=0;
	u1Byte				regType=0, bdAddr[6]={0}, calVal=0;
	u4Byte				regAddr=0, regValue=0;
	pu4Byte 			pu4Tmp;
	pu2Byte 			pu2Tmp;
	pu1Byte 			pu1Tmp;

	//
	// check upper layer parameters
	//
	
	// check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}
	// check upper layer parameter length
	if(pBtReq->paraLength < 1)
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d (should larger than 1)\n", pBtReq->paraLength);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	setParaLen = pBtReq->paraLength - 1;
	setType = pBtReq->pParamStart[0];
	
	DBG_8192C("[MPT], setType=%d, setParaLen=%d\n", setType, setParaLen);

